Revit 2026 API

# PartUtilsArePartsValidForDivide Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ArePartsValidForDivide(
	Document document,
	ICollection<ElementId> elementIdsToDivide
)
```
```vb
Public Shared Function ArePartsValidForDivide (
	document As Document,
	elementIdsToDivide As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool ArePartsValidForDivide(
	Document^ document,
	ICollection<ElementId^>^ elementIdsToDivide
)
```
```fsharp
static member ArePartsValidForDivide :
        document : Document *
        elementIdsToDivide : ICollection<ElementId> -> bool
```

#### Parameters

document Document

elementIdsToDivide ICollectionElementId

#### Return Value

Boolean

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace